In [3]:
# 데이터 재구조화 (Reshaping)

import pandas as pd

path = '../data/GroupAnalyze/exam_sample.csv'


df = pd.read_csv(path)


df

   student_no class  science  english  math sex
0           1     A       50       98    50   m
1           2     A       60       97    60   w
2           3     A       78       86    45   w
3           4     A       58       98    30   m
4           5     B       65       80    90   w
5           6     B       98       89    50   m
6           7     B       45       90    80   m
7           8     B       25       78    90   w
8           9     C       15       98    20   w
9          10     C       45       93    50   w

In [5]:
df['math'].describe()

count    10.000000
mean     56.500000
std      23.810595
min      20.000000
25%      46.250000
50%      50.000000
75%      75.000000
max      90.000000
Name: math, dtype: float64

In [10]:
df_cut_math = pd.cut(df['math'], 3)
df_cut_math

# cut 은 구간을 나눔

0    (43.333, 66.667]
1    (43.333, 66.667]
2    (43.333, 66.667]
3     (19.93, 43.333]
4      (66.667, 90.0]
5    (43.333, 66.667]
6      (66.667, 90.0]
7      (66.667, 90.0]
8     (19.93, 43.333]
9    (43.333, 66.667]
Name: math, dtype: category
Categories (3, interval[float64]): [(19.93, 43.333] < (43.333, 66.667] < (66.667, 90.0]]

In [14]:
df_cut_math_group = df['math'].groupby(df_cut_math)
df_cut_math_group.mean()

math
C학점    25.000000
B학점    51.000000
A학점    86.666667
Name: math, dtype: float64

In [9]:
df_cut_math_group.agg(['count', 'mean', 'std', 'min', 'max'])

                  count       mean       std  min  max
math
(19.93, 43.333]       2  25.000000  7.071068   20   30
(43.333, 66.667]      5  51.000000  5.477226   45   60
(66.667, 90.0]        3  86.666667  5.773503   80   90

In [11]:
df_cut_math = pd.cut(df['math'], 3, labels = ['C학점', 'B학점', 'A학점'])
df_cut_math

0    B학점
1    B학점
2    B학점
3    C학점
4    A학점
5    B학점
6    A학점
7    A학점
8    C학점
9    B학점
Name: math, dtype: category
Categories (3, object): ['C학점' < 'B학점' < 'A학점']

In [12]:
df_cut_math_group = df['math'].groupby(df_cut_math)
df_cut_math_group.agg(['count', 'mean', 'std', 'min', 'max'])

      count       mean       std  min  max
math
C학점       2  25.000000  7.071068   20   30
B학점       5  51.000000  5.477226   45   60
A학점       3  86.666667  5.773503   80   90

In [15]:
df['english'].describe()

count    10.000000
mean     90.700000
std       7.498889
min      78.000000
25%      86.750000
50%      91.500000
75%      97.750000
max      98.000000
Name: english, dtype: float64

In [16]:
df_qcut_english = pd.qcut(df['english'], 3)
df_qcut_english

0      (97.0, 98.0]
1      (89.0, 97.0]
2    (77.999, 89.0]
3      (97.0, 98.0]
4    (77.999, 89.0]
5    (77.999, 89.0]
6      (89.0, 97.0]
7    (77.999, 89.0]
8      (97.0, 98.0]
9      (89.0, 97.0]
Name: english, dtype: category
Categories (3, interval[float64]): [(77.999, 89.0] < (89.0, 97.0] < (97.0, 98.0]]

In [17]:
df_cut_english_group = df['english'].groupby(df_qcut_english)
df_cut_english_group.agg(['count', 'mean', 'std', 'min', 'max'])

                count       mean       std  min  max
english
(77.999, 89.0]      4  83.250000  5.123475   78   89
(89.0, 97.0]        3  93.333333  3.511885   90   97
(97.0, 98.0]        3  98.000000  0.000000   98   98

In [18]:
df_qcut_english = pd.qcut(df['english'], 3, labels=False)
df_qcut_english

0    2
1    1
2    0
3    2
4    0
5    0
6    1
7    0
8    2
9    1
Name: english, dtype: int64

In [19]:
df_cut_english_group = df['english'].groupby(df_qcut_english)
df_cut_english_group.agg(['count', 'mean', 'std', 'min', 'max'])

         count       mean       std  min  max
english
0            4  83.250000  5.123475   78   89
1            3  93.333333  3.511885   90   97
2            3  98.000000  0.000000   98   98